## More on using Pandas

First import the libraries needed.

In [1]:
%matplotlib inline
import numpy as np
import scipy as sp
import matplotlib as mpl
import matplotlib.cm as cm
import matplotlib.pyplot as plt
import pandas as pd
pd.set_option('display.width', 500)
pd.set_option('display.max_columns', 100)
pd.set_option('display.notebook_repr_html', True)
import seaborn as sns

In [2]:
# pass in column names for each CSV

import pandas as pd
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv(
    'u.user',
sep = '|', names = u_cols)

users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

What happens in the code above?
```python

import pandas as pd # this is the module needed to load the data

# save into a variable the list of column names needed for the data
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

# this is the code needed to actually read the whole csv file
# you can use the url or you can use the local file in your directory
# in my case I used the local directory file (the file should be in the same directory)

users = pd.read_csv(
    'u.user',
sep = '|', names = u_cols)

# <sep> means separator
# <names> are the column names
 
users.head()
# this command will just display the first 5 data

```
This is the original file and filename directly to the link.
>http://files.grouplens.org/datasets/movielens/ml-100k/u.user

In [3]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv(
    'u.txt', 
    sep='\t', names=r_cols)

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [4]:
# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies = pd.read_csv(
    'u_movies.txt', 
    sep='|', names=m_cols, usecols=range(5), encoding = '"ISO-8859-1"')

movies.head()

   movie_id              title release_date  video_release_date                                           imdb_url
0         1   Toy Story (1995)  01-Jan-1995                 NaN  http://us.imdb.com/M/title-exact?Toy%20Story%2...
1         2   GoldenEye (1995)  01-Jan-1995                 NaN  http://us.imdb.com/M/title-exact?GoldenEye%20(...
2         3  Four Rooms (1995)  01-Jan-1995                 NaN  http://us.imdb.com/M/title-exact?Four%20Rooms%...
3         4  Get Shorty (1995)  01-Jan-1995                 NaN  http://us.imdb.com/M/title-exact?Get%20Shorty%...
4         5     Copycat (1995)  01-Jan-1995                 NaN  http://us.imdb.com/M/title-exact?Copycat%20(1995)

The `usecols` parameter in the code before this cell just tells us to only use the several columns stated or value it's been given.

In [5]:
print (movies.dtypes)
print ()
print (movies.describe())

# it only included 2 columns
# other columns are not numbers which is considered as objects

#movies.describe?

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

In [6]:
users.head()
users['occupation'].head()
## *** Where did the nice design go? ***
columns_you_want = ['occupation', 'sex'] 
(users[columns_you_want].head())


# print (users.iloc[3]) use this to access the row via the index number

# you can use subframes to show the data that is relevant for you.

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

In [7]:
users.iloc[3]

user_id                4
age                   24
sex                    M
occupation    technician
zip_code           43537
Name: 3, dtype: object

One column is called a series in pandas.

### Filter Data

In [8]:
oldUsers = users[users.age > 25]
oldUsers.head()

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

In the code below, you are asked to only filter out those who are male and having age 40.

In [9]:
male_40 = users[(users.age == 40) & (users.sex == "M")]
male_40.head()

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629

Asked for the mean age of Female Programmers.

In [10]:
female = users [users.sex == "F"]
np.mean(female.age)

33.81318681318681

### Split - Apply - Combine

<img src = "split_apply.png">

In [114]:
print (ratings.head())
## split data
#grouped_data = ratings.groupby('user_id')
grouped_data = ratings['movie_id'].groupby(ratings['user_id']) # This is used for just 1 (ONE) column

## count and combine
ratings_per_user = grouped_data.count() # .count is a function


ratings_per_user.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

user_id
1    272
2     62
3     54
4     24
5    175
Name: movie_id, dtype: int64

In splitting the data, the `ratings.groupby('user_id')` is telling the computer to group the `ratings` variable by their user ids. The command `.groupby` *(Use .groupby?) to check the documentation* will group the data depending on what is passed through as a parameter.

In [135]:
print (ratings.head())

grouped_movie_ratings = ratings['rating'].groupby(ratings['movie_id'])

ave_ratings = grouped_movie_ratings.mean()

ave_ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

In [139]:
maximum_rating = ave_ratings.max()
good_movie_ids = ave_ratings[ave_ratings == maximum_rating].index

print ("Good movie ids:")
print (good_movie_ids)
print ()

print ("Best movie titles")
print (movies[movies.movie_id.isin(good_movie_ids)].title)

Good movie ids:
Int64Index([814, 1122, 1189, 1201, 1293, 1467, 1500, 1536, 1599, 1653], dtype='int64', name='movie_id')

Best movie titles
813                         Great Day in Harlem, A (1994)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1598                        Someone Else's America (1995)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

The code above is quote complicated. 

This will get the maximum or the highest values and save it into the variable maximum_rating


>`maximum_rating = ave_ratings.max()`


The IDs are saved into  the variable using the `.index` function.

>`good_movie_ids = ave_ratings[ave_ratings == maximum_rating].index`

The code above says that in the `ave_rating` series, check in which the `ave_ratings == maximum_rating` returns `True`, if it returns a True value, get the index using the `.index` function.

>print (good_movie_ids)

>print ("Best movie titles")

This one is the most complicated. 

>print (movies[movies.movie_id.isin(good_movie_ids)].title)

Inside the movies, in the subset of movies within the `movie_id` column, check if it is in `(good_movie_ids)` and return it with the ending of the function `.title`

In [142]:
how_many_ratings = grouped_data.count()
how_many_ratings[ave_ratings == maximum_rating]

movie_id
814     1
1122    1
1189    3
1201    1
1293    3
1467    2
1500    2
1536    1
1599    1
1653    1
Name: rating, dtype: int64

We use the count function in the series of grouped data `grouped_data`.

Then we pass the argument inside the subset in which what values or conditions are we trying to pass it (inside the brackets)

In [146]:
average_ratings = grouped_data.apply(lambda f: f.mean())
average_ratings.head()

movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

What is  this?
> `.apply` is the method to apply the function or call a function

> `lambda f:` this is the syntax

> `f.mean` what you do with the f.

Questions:

Get the average rating per user. <br>
List all occupations and if they are male or female dominant.